RobyGabriel/RUDI/rudi-sim-obstacol/stm32/src/main.c
/* RUDI — simulare livrare cu evitare de obstacol (STM32F769I-DISCO)
 *
 * Cablaj (header Arduino) — vezi README:
 *   Driver motoare: PWM1=D3(PF6,TIM10_CH1) DIR1=D4(PJ0)
 *                   PWM2=D6(PF7,TIM11_CH1) DIR2=D7(PJ3), +5V, GND
 *   HC-SR04:  TRIG=D2(PJ1), ECHO=D5(PC8, divizor 1k/2k), VCC=5V
 *   MPU6050:  SCL=D15(PB8), SDA=D14(PB9), VCC=3V3
 *   RC522:    SCK=D13(PA12) MISO=D12(PB14) MOSI=D11(PB15)
 *             CS=D10(PA11) RST=D8(PJ4), VCC=3V3
 *   ESP32:    D0(PC7)=RX <- ESP GPIO4(TX), D1(PC6)=TX -> ESP GPIO5(RX)
 *
 * Comenzi (text + newline, pe USART6/ESP sau pe consola ST-Link):
 *   DEMO - misiune ghidata: mers -> operatorul pune obstacol -> stop ->
 *          ocolire cu giroscop -> sosire -> confirmare RFID
 *   GO   - la fel ca DEMO dar fara mesajele de ghidare pas cu pas
 *   MOT  - puls scurt ambele motoare inainte (verificare sens)
 *   MOTR - puls scurt ambele motoare inapoi (verificare sens)
 *   S    - status senzori o singura data
 *   GYRO - 10 mostre raw MPU6050, fara sa fie necesara miscarea placii
 *   RFID - diagnostic RC522 si asteptare tag timp de 15 secunde
 *   X    - STOP DE URGENTA (functioneaza oricand)
 */

#include "stm32f7xx_hal.h"
#include "rc522.h"
#include <stdarg.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

/* ================= CONFIG (de ajustat la nevoie) ================= */
#define CRUISE_DUTY 450        /* 45% din 1000 — mers normal */
#define TURN_DUTY 400          /* 40% — viraje pe loc */
#define RAMP_STEP 40           /* pas rampa (din 1000) la fiecare 20 ms */
#define OBSTACLE_STOP_CM 25    /* sub atat = obstacol, oprire */
#define AVOID_TURN_DEG 80.0f   /* unghi viraj ocolire */
#define BYPASS_DRIVE_MS 1500   /* avans lateral in timpul ocolirii */
#define FINAL_DRIVE_MS 3000    /* mers dupa ocolire pana la "destinatie" */
#define OBSTACLE_WAIT_MS 60000 /* cat astept obstacolul in DEMO */
#define RFID_WAIT_MS 60000     /* cat astept scanarea la sosire */
#define TURN_TIMEOUT_MS 5000   /* limita de siguranta pentru un viraj */

/* Sensuri — daca robotul merge invers la comanda MOT, schimba 1<->0.
   Daca virajul "dreapta" iese stanga, schimba TURN_RIGHT_SIGN in -1. */
#define M1_DIR_FORWARD 1 /* nivel pe DIR1 pentru "inainte" */
#define M2_DIR_FORWARD 1
#define TURN_RIGHT_SIGN 1
/* ================================================================== */

#define TRIG_PORT GPIOJ
#define TRIG_PIN GPIO_PIN_1
#define ECHO_PORT GPIOC
#define ECHO_PIN GPIO_PIN_8

#define MPU_ADDR (0x68 << 1)

static UART_HandleTypeDef huart1; /* consola ST-Link */
static UART_HandleTypeDef huart6; /* legatura ESP32  */
static I2C_HandleTypeDef hi2c1;
static SPI_HandleTypeDef hspi2;
static TIM_HandleTypeDef htim10;
static TIM_HandleTypeDef htim11;
static rc522_t rfid;

static bool mpu_ok = false;
static float gyro_bias_z = 0.0f;
static volatile bool estop = false;

/* ---------- iesire pe AMBELE seriale ---------- */
static void print_both(const char *fmt, ...) {
  char buf[160];
  va_list ap;
  va_start(ap, fmt);
  int n = vsnprintf(buf, sizeof(buf), fmt, ap);
  va_end(ap);
  if (n < 0) {
    return;
  }
  if (n > (int)sizeof(buf) - 1) {
    n = sizeof(buf) - 1;
  }
  HAL_UART_Transmit(&huart1, (uint8_t *)buf, (uint16_t)n, 50);
  HAL_UART_Transmit(&huart6, (uint8_t *)buf, (uint16_t)n, 50);
}

int __io_putchar(int ch) {
  uint8_t c = (uint8_t)ch;
  HAL_UART_Transmit(&huart1, &c, 1, 10);
  return ch;
}

/* ---------- ceas 216 MHz ---------- */
static void SystemClock_Config(void) {
  RCC_OscInitTypeDef osc = {0};
  RCC_ClkInitTypeDef clk = {0};
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  osc.OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI;
  osc.HSEState = RCC_HSE_ON;
  osc.HSIState = RCC_HSI_ON;
  osc.PLL.PLLState = RCC_PLL_ON;
  osc.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  osc.PLL.PLLM = 25;
  osc.PLL.PLLN = 432;
  osc.PLL.PLLP = RCC_PLLP_DIV2;
  osc.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
    for (;;) {
    }
  }
  HAL_PWREx_EnableOverDrive();
  clk.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  clk.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clk.APB1CLKDivider = RCC_HCLK_DIV4;
  clk.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_7) != HAL_OK) {
    for (;;) {
    }
  }
}

/* ---------- microsecunde pe DWT ---------- */
static void dwt_init(void) {
  CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  DWT->LAR = 0xC5ACCE55;
  DWT->CYCCNT = 0;
  DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}
static inline uint32_t micros(void) {
  return DWT->CYCCNT / (SystemCoreClock / 1000000U);
}
static inline void delay_us(uint32_t us) {
  uint32_t s = DWT->CYCCNT, t = us * (SystemCoreClock / 1000000U);
  while (DWT->CYCCNT - s < t) {
  }
}

/* ---------- GPIO + periferice ---------- */
static void gpio_init(void) {
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOJ_CLK_ENABLE();

  GPIO_InitTypeDef g = {0};

  /* USART1 PA9/PA10 (VCP) */
  g.Pin = GPIO_PIN_9 | GPIO_PIN_10;
  g.Mode = GPIO_MODE_AF_PP;
  g.Pull = GPIO_PULLUP;
  g.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  g.Alternate = GPIO_AF7_USART1;
  HAL_GPIO_Init(GPIOA, &g);

  /* USART6 PC6 TX / PC7 RX (ESP32) */
  g.Pin = GPIO_PIN_6 | GPIO_PIN_7;
  g.Alternate = GPIO_AF8_USART6;
  HAL_GPIO_Init(GPIOC, &g);

  /* I2C1 PB8/PB9 */
  g.Pin = GPIO_PIN_8 | GPIO_PIN_9;
  g.Mode = GPIO_MODE_AF_OD;
  g.Pull = GPIO_NOPULL;
  g.Speed = GPIO_SPEED_FREQ_HIGH;
  g.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &g);

  /* SPI2 PB14/PB15 + PA12 */
  g.Pin = GPIO_PIN_14 | GPIO_PIN_15;
  g.Mode = GPIO_MODE_AF_PP;
  g.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &g);
  g.Pin = GPIO_PIN_12;
  HAL_GPIO_Init(GPIOA, &g);

  /* PWM: PF6 TIM10_CH1, PF7 TIM11_CH1 */
  g.Pin = GPIO_PIN_6;
  g.Mode = GPIO_MODE_AF_PP;
  g.Alternate = GPIO_AF3_TIM10;
  HAL_GPIO_Init(GPIOF, &g);
  g.Pin = GPIO_PIN_7;
  g.Alternate = GPIO_AF3_TIM11;
  HAL_GPIO_Init(GPIOF, &g);

  /* Iesiri: CS RC522 (PA11), RST RC522 (PJ4), TRIG (PJ1), DIR1 (PJ0), DIR2 (PJ3) */
  g.Mode = GPIO_MODE_OUTPUT_PP;
  g.Pull = GPIO_NOPULL;
  g.Speed = GPIO_SPEED_FREQ_HIGH;
  g.Pin = GPIO_PIN_11;
  HAL_GPIO_Init(GPIOA, &g);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_11, GPIO_PIN_SET);
  g.Pin = GPIO_PIN_4 | GPIO_PIN_1 | GPIO_PIN_0 | GPIO_PIN_3;
  HAL_GPIO_Init(GPIOJ, &g);
  HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_4, GPIO_PIN_SET);
  HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_1 | GPIO_PIN_0 | GPIO_PIN_3,
                    GPIO_PIN_RESET);

  /* ECHO PC8 intrare */
  g.Pin = ECHO_PIN;
  g.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(ECHO_PORT, &g);
}

static void uart_init_one(UART_HandleTypeDef *h, USART_TypeDef *inst) {
  h->Instance = inst;
  h->Init.BaudRate = 115200;
  h->Init.WordLength = UART_WORDLENGTH_8B;
  h->Init.StopBits = UART_STOPBITS_1;
  h->Init.Parity = UART_PARITY_NONE;
  h->Init.Mode = UART_MODE_TX_RX;
  h->Init.HwFlowCtl = UART_HWCONTROL_NONE;
  h->Init.OverSampling = UART_OVERSAMPLING_16;
  HAL_UART_Init(h);
}

static void periph_init(void) {
  __HAL_RCC_USART1_CLK_ENABLE();
  __HAL_RCC_USART6_CLK_ENABLE();
  uart_init_one(&huart1, USART1);
  uart_init_one(&huart6, USART6);
  /* receptie pe intreruperi */
  HAL_NVIC_SetPriority(USART1_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(USART1_IRQn);
  HAL_NVIC_SetPriority(USART6_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(USART6_IRQn);
  SET_BIT(USART1->CR1, USART_CR1_RXNEIE);
  SET_BIT(USART6->CR1, USART_CR1_RXNEIE);

  __HAL_RCC_I2C1_CONFIG(RCC_I2C1CLKSOURCE_HSI);
  __HAL_RCC_I2C1_CLK_ENABLE();
  hi2c1.Instance = I2C1;
  hi2c1.Init.Timing = 0x30420F13;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  HAL_I2C_Init(&hi2c1);

  __HAL_RCC_SPI2_CLK_ENABLE();
  hspi2.Instance = SPI2;
  hspi2.Init.Mode = SPI_MODE_MASTER;
  hspi2.Init.Direction = SPI_DIRECTION_2LINES;
  hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi2.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi2.Init.NSS = SPI_NSS_SOFT;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
  hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
  HAL_SPI_Init(&hspi2);

