RobyGabriel/RUDI/rudi-sim-obstacol/stm32/src/main.c
  /* TIM10/TIM11: PWM 1 kHz, rezolutie 1000 (ceas timere APB2 = 216 MHz) */
  __HAL_RCC_TIM10_CLK_ENABLE();
  __HAL_RCC_TIM11_CLK_ENABLE();
  TIM_OC_InitTypeDef oc = {0};
  oc.OCMode = TIM_OCMODE_PWM1;
  oc.Pulse = 0;
  oc.OCPolarity = TIM_OCPOLARITY_HIGH;

  htim10.Instance = TIM10;
  htim10.Init.Prescaler = 215;
  htim10.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim10.Init.Period = 999;
  HAL_TIM_PWM_Init(&htim10);
  HAL_TIM_PWM_ConfigChannel(&htim10, &oc, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim10, TIM_CHANNEL_1);

  htim11.Instance = TIM11;
  htim11.Init.Prescaler = 215;
  htim11.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim11.Init.Period = 999;
  HAL_TIM_PWM_Init(&htim11);
  HAL_TIM_PWM_ConfigChannel(&htim11, &oc, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim11, TIM_CHANNEL_1);
}

/* ---------- motoare ---------- */
static void motor_set(int motor, int forward, uint32_t duty) {
  if (duty > 999) {
    duty = 999;
  }
  if (motor == 1) {
    int level = forward ? M1_DIR_FORWARD : !M1_DIR_FORWARD;
    HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_0,
                      level ? GPIO_PIN_SET : GPIO_PIN_RESET);
    __HAL_TIM_SET_COMPARE(&htim10, TIM_CHANNEL_1, duty);
  } else {
    int level = forward ? M2_DIR_FORWARD : !M2_DIR_FORWARD;
    HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_3,
                      level ? GPIO_PIN_SET : GPIO_PIN_RESET);
    __HAL_TIM_SET_COMPARE(&htim11, TIM_CHANNEL_1, duty);
  }
}

static void motors_stop(void) {
  __HAL_TIM_SET_COMPARE(&htim10, TIM_CHANNEL_1, 0);
  __HAL_TIM_SET_COMPARE(&htim11, TIM_CHANNEL_1, 0);
}

/* ---------- senzori (ca in testul validat) ---------- */
static bool mpu_write(uint8_t reg, uint8_t val) {
  return HAL_I2C_Mem_Write(&hi2c1, MPU_ADDR, reg, 1, &val, 1, 100) == HAL_OK;
}
static bool mpu_read(uint8_t reg, uint8_t *buf, uint16_t len) {
  return HAL_I2C_Mem_Read(&hi2c1, MPU_ADDR, reg, 1, buf, len, 100) == HAL_OK;
}
static bool mpu_read_gz_raw(int16_t *out) {
  uint8_t b[2];
  if (!mpu_read(0x47, b, 2)) {
    return false;
  }
  *out = (int16_t)((b[0] << 8) | b[1]);
  return true;
}
static bool mpu_read_motion_raw(int16_t *ax, int16_t *ay, int16_t *az,
                                int16_t *gx, int16_t *gy, int16_t *gz) {
  uint8_t b[14];
  if (!mpu_read(0x3B, b, sizeof(b))) {
    return false;
  }
  *ax = (int16_t)((b[0] << 8) | b[1]);
  *ay = (int16_t)((b[2] << 8) | b[3]);
  *az = (int16_t)((b[4] << 8) | b[5]);
  *gx = (int16_t)((b[8] << 8) | b[9]);
  *gy = (int16_t)((b[10] << 8) | b[11]);
  *gz = (int16_t)((b[12] << 8) | b[13]);
  return true;
}
static float mpu_gz_dps(void) {
  int16_t raw;
  if (!mpu_read_gz_raw(&raw)) {
    return 0.0f;
  }
  return ((float)raw - gyro_bias_z) / 131.0f;
}

static void mpu_init(void) {
  uint8_t who = 0;
  if (!mpu_read(0x75, &who, 1)) {
    print_both("MPU6050: absent!\r\n");
    return;
  }
  mpu_write(0x6B, 0x00);
  HAL_Delay(50);
  mpu_write(0x1A, 0x03);
  mpu_write(0x1B, 0x00);
  HAL_Delay(50);
  int32_t sum = 0;
  int good = 0;
  for (int i = 0; i < 200; i++) {
    int16_t raw;
    if (mpu_read_gz_raw(&raw)) {
      sum += raw;
      good++;
    }
    HAL_Delay(2);
  }
  if (good > 100) {
    gyro_bias_z = (float)sum / (float)good;
    mpu_ok = true;
  }
  print_both("MPU6050: WHO_AM_I=0x%02X, bias=%.1f, %s\r\n", who, gyro_bias_z,
             mpu_ok ? "OK" : "EROARE CALIBRARE");
}

static int32_t hcsr04_mm(void) {
  HAL_GPIO_WritePin(TRIG_PORT, TRIG_PIN, GPIO_PIN_SET);
  delay_us(10);
  HAL_GPIO_WritePin(TRIG_PORT, TRIG_PIN, GPIO_PIN_RESET);
  uint32_t t0 = micros();
  while (HAL_GPIO_ReadPin(ECHO_PORT, ECHO_PIN) == GPIO_PIN_RESET) {
    if (micros() - t0 > 30000) {
      return -1;
    }
  }
  uint32_t rise = micros();
  while (HAL_GPIO_ReadPin(ECHO_PORT, ECHO_PIN) == GPIO_PIN_SET) {
    if (micros() - rise > 30000) {
      return -1;
    }
  }
  return (int32_t)((micros() - rise) * 10 / 58);
}

/* mediana pe 3 masuratori rapide, robusta la un outlier */
static int32_t distance_mm(void) {
  int32_t a = hcsr04_mm();
  HAL_Delay(15);
  int32_t b = hcsr04_mm();
  HAL_Delay(15);
  int32_t c = hcsr04_mm();
  if (a < 0 && b < 0 && c < 0) {
    return -1;
  }
  /* inlocuieste timeout-urile cu o valoare mare, apoi mediana */
  int32_t big = 999999;
  int32_t x = a < 0 ? big : a, y = b < 0 ? big : b, z = c < 0 ? big : c;
  int32_t lo = x < y ? (x < z ? x : z) : (y < z ? y : z);
  int32_t hi = x > y ? (x > z ? x : z) : (y > z ? y : z);
  int32_t med = x + y + z - lo - hi;
  return med == big ? -1 : med;
}

/* ---------- intrare seriala pe intreruperi (USART-urile F7 nu au FIFO;
   polling-ul pierdea al doilea octet din rafala prin overrun) ---------- */
#define RB_SIZE 128
static volatile uint8_t rb1_buf[RB_SIZE], rb6_buf[RB_SIZE];
static volatile uint8_t rb1_head = 0, rb1_tail = 0;
static volatile uint8_t rb6_head = 0, rb6_tail = 0;

void USART1_IRQHandler(void) {
  if (USART1->ISR & USART_ISR_RXNE) {
    uint8_t c = (uint8_t)USART1->RDR;
    uint8_t next = (uint8_t)((rb1_head + 1) % RB_SIZE);
    if (next != rb1_tail) {
      rb1_buf[rb1_head] = c;
      rb1_head = next;
    }
  }
  USART1->ICR = USART_ICR_ORECF | USART_ICR_FECF | USART_ICR_NCF;
}

void USART6_IRQHandler(void) {
  if (USART6->ISR & USART_ISR_RXNE) {
    uint8_t c = (uint8_t)USART6->RDR;
    uint8_t next = (uint8_t)((rb6_head + 1) % RB_SIZE);
    if (next != rb6_tail) {
      rb6_buf[rb6_head] = c;
      rb6_head = next;
    }
  }
  USART6->ICR = USART_ICR_ORECF | USART_ICR_FECF | USART_ICR_NCF;
}

static bool rb1_pop(uint8_t *out) {
  if (rb1_head == rb1_tail) {
    return false;
  }
  *out = rb1_buf[rb1_tail];
  rb1_tail = (uint8_t)((rb1_tail + 1) % RB_SIZE);
  return true;
}

static bool rb6_pop(uint8_t *out) {
  if (rb6_head == rb6_tail) {
    return false;
  }
  *out = rb6_buf[rb6_tail];
  rb6_tail = (uint8_t)((rb6_tail + 1) % RB_SIZE);
  return true;
}

static char line1[32], line6[32];
static int len1 = 0, len6 = 0;

static const char *poll_uart(UART_HandleTypeDef *h, char *line, int *len) {
  uint8_t c;
  bool is_vcp = (h == &huart1);
  while (is_vcp ? rb1_pop(&c) : rb6_pop(&c)) {
    if (c == '\r' || c == '\n') {
      if (*len > 0) {
        line[*len] = 0;
        *len = 0;
        return line;
      }
    } else if (*len < 31) {
      line[(*len)++] = (char)(c >= 'a' && c <= 'z' ? c - 32 : c);
    }
  }
  return NULL;
}

/* Intoarce comanda completa (linie) daca exista, de pe oricare port. */
static const char *poll_command(void) {
  const char *cmd = poll_uart(&huart1, line1, &len1);
  if (cmd) {
    return cmd;
  }
  return poll_uart(&huart6, line6, &len6);
}

/* Verifica X/STOP; de apelat des in orice bucla activa. */
static bool check_estop(void) {
  const char *cmd = poll_command();
  if (cmd && (strcmp(cmd, "X") == 0 || strcmp(cmd, "STOP") == 0)) {
    motors_stop();
    estop = true;
    print_both("STOP DE URGENTA\r\n");
    return true;
  }
  return false;
}

