RobyGabriel/RUDI/rudi-sim-obstacol/stm32/src/main.c
/* asteptare cu estop; intoarce false daca s-a cerut oprirea */
static bool wait_ms(uint32_t ms) {
  uint32_t start = HAL_GetTick();
  while (HAL_GetTick() - start < ms) {
    if (check_estop()) {
      return false;
    }
    HAL_Delay(5);
  }
  return true;
}

/* rampa ambelor motoare la duty tinta, inainte */
static bool ramp_forward(uint32_t target) {
  for (uint32_t d = RAMP_STEP; d < target; d += RAMP_STEP) {
    motor_set(1, 1, d);
    motor_set(2, 1, d);
    if (!wait_ms(20)) {
      return false;
    }
  }
  motor_set(1, 1, target);
  motor_set(2, 1, target);
  return true;
}

/* viraj pe loc cu integrarea giroscopului; sign: +1 dreapta, -1 stanga */
static bool gyro_turn(float degrees, int sign) {
  sign *= TURN_RIGHT_SIGN;
  float angle = 0.0f;
  uint32_t last = HAL_GetTick();
  uint32_t start = last;

  motor_set(1, sign > 0 ? 1 : 0, TURN_DUTY);
  motor_set(2, sign > 0 ? 0 : 1, TURN_DUTY);

  while (HAL_GetTick() - start < TURN_TIMEOUT_MS) {
    if (check_estop()) {
      return false;
    }
    HAL_Delay(5);
    uint32_t now = HAL_GetTick();
    float dt = (float)(now - last) / 1000.0f;
    last = now;
    if (mpu_ok) {
      float gz = mpu_gz_dps();
      angle += gz * dt;
      if (angle < 0) {
        /* lucram cu modulul */
      }
      float a = angle < 0 ? -angle : angle;
      if (a >= degrees) {
        break;
      }
    } else if (now - start > 900) {
      break; /* fara giroscop: viraj pe timp, ~0.9 s */
    }
  }
  motors_stop();
  print_both("VIRAJ: %+.1f grade masurate\r\n", (double)angle);
  return wait_ms(300);
}

/* mers inainte cu supraveghere HC-SR04; se opreste la obstacol sau dupa ms.
   Intoarce: 1=parcurs complet, 0=obstacol intalnit, -1=estop */
static int drive_forward_watch(uint32_t ms, bool stop_on_obstacle) {
  if (!ramp_forward(CRUISE_DUTY)) {
    return -1;
  }
  uint32_t start = HAL_GetTick();
  while (ms == 0 || HAL_GetTick() - start < ms) {
    if (check_estop()) {
      return -1;
    }
    int32_t mm = distance_mm();
    if (stop_on_obstacle && mm >= 0 && mm < OBSTACLE_STOP_CM * 10) {
      motors_stop();
      print_both("OBSTACOL la %ld.%ld cm — STOP!\r\n", mm / 10, mm % 10);
      return 0;
    }
    HAL_Delay(20);
  }
  motors_stop();
  return 1;
}

/* ---------- misiunea ---------- */
static void mission(bool guided) {
  estop = false;
  print_both("\r\n=== MISIUNE PORNITA (%s) ===\r\n",
             guided ? "DEMO ghidat" : "GO");

  if (guided) {
    print_both(">>> Robotul porneste inainte la %d%%.\r\n", CRUISE_DUTY / 10);
    print_both(">>> OPERATOR: cand vrei, PUNE UN OBIECT la sub %d cm in fata "
               "senzorului ultrasonic!\r\n",
               OBSTACLE_STOP_CM);
  }

  /* Faza 1: mers pana la obstacol (sau timeout) */
  uint32_t phase_start = HAL_GetTick();
  int r = drive_forward_watch(OBSTACLE_WAIT_MS, true);
  if (r < 0) {
    return;
  }
  if (r == 1) {
    print_both("Nu a aparut niciun obstacol in %lu s — misiune anulata.\r\n",
               (unsigned long)(OBSTACLE_WAIT_MS / 1000));
    return;
  }
  (void)phase_start;

  if (!wait_ms(800)) {
    return;
  }

  /* Faza 2: ocolire — dreapta, avans, stanga, revenire pe traseu */
  if (guided) {
    print_both(">>> Ocolesc obstacolul: viraj dreapta ~%.0f grade...\r\n",
               (double)AVOID_TURN_DEG);
  }
  if (!gyro_turn(AVOID_TURN_DEG, +1)) {
    return;
  }

  if (guided) {
    print_both(">>> Avansez pe langa obstacol...\r\n");
  }
  r = drive_forward_watch(BYPASS_DRIVE_MS, false);
  if (r < 0) {
    return;
  }
  if (!wait_ms(300)) {
    return;
  }

  if (guided) {
    print_both(">>> Viraj stanga ~%.0f grade — revin pe directia initiala.\r\n",
               (double)AVOID_TURN_DEG);
  }
  if (!gyro_turn(AVOID_TURN_DEG, -1)) {
    return;
  }

  /* Faza 3: ultimii metri pana la destinatie */
  if (guided) {
    print_both(">>> Continui spre destinatie...\r\n");
  }
  r = drive_forward_watch(FINAL_DRIVE_MS, true);
  if (r < 0) {
    return;
  }
  if (r == 0) {
    print_both("Alt obstacol pe final — ma opresc aici.\r\n");
  }

  motors_stop();
  print_both("=== AM AJUNS LA DESTINATIE ===\r\n");
  print_both(">>> OPERATOR: scaneaza tagul RFID pentru confirmarea "
             "livrarii!\r\n");

  /* Faza 4: confirmare RFID */
  uint32_t start = HAL_GetTick();
  while (HAL_GetTick() - start < RFID_WAIT_MS) {
    if (check_estop()) {
      return;
    }
    uint8_t uid[4];
    if (rc522_read_uid(&rfid, uid)) {
      print_both("=== LIVRARE CONFIRMATA — UID=%02X:%02X:%02X:%02X ===\r\n",
                 uid[0], uid[1], uid[2], uid[3]);
      return;
    }
    HAL_Delay(100);
  }
  print_both("Nimeni nu a confirmat in %lu s — misiune incheiata fara "
             "confirmare.\r\n",
             (unsigned long)(RFID_WAIT_MS / 1000));
}

static void motor_sanity_pulse(void) {
  print_both("MOT: ambele motoare INAINTE 40%% pentru 3.0 s — verifica "
             "sensul!\r\n");
  motor_set(1, 1, 400);
  motor_set(2, 1, 400);
  wait_ms(3000);
  motors_stop();
  print_both("MOT: stop. Daca vreun motor a mers invers, schimba "
             "M1_DIR_FORWARD/M2_DIR_FORWARD in main.c.\r\n");
}

static void motor_reverse_sanity_pulse(void) {
  print_both("MOTR: ambele motoare INAPOI 40%% pentru 3.0 s — verifica "
             "sensul!\r\n");
  motor_set(1, 0, 400);
  motor_set(2, 0, 400);
  wait_ms(3000);
  motors_stop();
  print_both("MOTR: stop.\r\n");
}

static void gyro_diagnostic(void) {
  uint8_t who = 0;
  if (!mpu_read(0x75, &who, 1)) {
    print_both("GYRO: eroare I2C, MPU6050 nu raspunde.\r\n");
    return;
  }

  print_both("GYRO: WHO_AM_I=0x%02X, 10 mostre statice raw "
             "(A=accelerometru, G=giroscop).\r\n",
             who);
  for (int i = 0; i < 10; i++) {
    int16_t ax, ay, az, gx, gy, gz;
    if (!mpu_read_motion_raw(&ax, &ay, &az, &gx, &gy, &gz)) {
      print_both("GYRO[%02d]: eroare citire I2C\r\n", i + 1);
      return;
    }
    float gz_corrected = ((float)gz - gyro_bias_z) / 131.0f;
    print_both("GYRO[%02d] A=(%d,%d,%d) G=(%d,%d,%d) "
               "GZ_CORR=%+.2f dps\r\n",
               i + 1, ax, ay, az, gx, gy, gz, (double)gz_corrected);
    if (!wait_ms(100)) {
      return;
    }
  }
  print_both("GYRO: I2C si citirea tuturor axelor sunt functionale; "
             "testul dinamic necesita miscarea modulului.\r\n");
}

