RobyGabriel/RUDI/rudi-sim-obstacol/stm32/src/main.c
static void rfid_diagnostic(void) {
  uint8_t version = rc522_version(&rfid);
  uint8_t tx_control = rc522_tx_control(&rfid);
  uint8_t rf_config = rc522_rf_config(&rfid);
  unsigned long no_atqa = 0;
  unsigned long anticoll_failed = 0;
  unsigned long bcc_failed = 0;

  print_both("RFID: VersionReg=0x%02X TxControl=0x%02X RFCfg=0x%02X "
             "ANTENA=%s GAIN=%u\r\n",
             version, tx_control, rf_config,
             (tx_control & 0x03) == 0x03 ? "ON" : "OFF",
             (unsigned)((rf_config >> 4) & 0x07));
  print_both("RFID: apropie un tag 13.56 MHz ISO14443A timp de 15 s...\r\n");

  uint32_t start = HAL_GetTick();
  while (HAL_GetTick() - start < 15000U) {
    uint8_t uid[4];
    rc522_uid_result_t result = rc522_read_uid_diagnostic(&rfid, uid);
    if (result == RC522_UID_OK) {
      print_both("RFID: TAG OK dupa %lu ms, UID=%02X:%02X:%02X:%02X\r\n",
                 (unsigned long)(HAL_GetTick() - start), uid[0], uid[1], uid[2],
                 uid[3]);
      return;
    }
    if (result == RC522_UID_NO_ATQA) {
      no_atqa++;
    } else if (result == RC522_UID_ANTICOLLISION_FAILED) {
      anticoll_failed++;
    } else {
      bcc_failed++;
    }
    if (!wait_ms(50)) {
      return;
    }
  }

  print_both("RFID: niciun UID. REQA_fara_ATQA=%lu ANTICOLL_fail=%lu "
             "BCC_fail=%lu\r\n",
             no_atqa, anticoll_failed, bcc_failed);
  print_both("RFID: foloseste card/tag 13.56 MHz ISO14443A; tagurile "
             "125 kHz nu sunt compatibile cu RC522.\r\n");
}

static void status_once(void) {
  int32_t mm = distance_mm();
  float gz = mpu_ok ? mpu_gz_dps() : 0.0f;
  uint8_t uid[4];
  bool tag = rc522_read_uid(&rfid, uid);
  if (mm >= 0) {
    print_both("DIST=%ld.%ld cm", mm / 10, mm % 10);
  } else {
    print_both("DIST=---");
  }
  print_both(" | GZ=%+.1f dps | MPU=%s | RC522 ver=0x%02X | TAG=%s\r\n",
             (double)gz, mpu_ok ? "OK" : "ERR", rc522_version(&rfid),
             tag ? "DA" : "--");
}

int main(void) {
  HAL_Init();
  SystemClock_Config();
  dwt_init();
  gpio_init();
  periph_init();
  motors_stop();

  print_both("\r\n=== RUDI SIM EVITARE OBSTACOL — F769I-DISCO ===\r\n");
  mpu_init();
  rfid.hspi = &hspi2;
  rfid.cs_port = GPIOA;
  rfid.cs_pin = GPIO_PIN_11;
  rfid.rst_port = GPIOJ;
  rfid.rst_pin = GPIO_PIN_4;
  rc522_init(&rfid);
  print_both("RC522: VersionReg=0x%02X\r\n", rc522_version(&rfid));
  print_both("Comenzi: DEMO | GO | MOT | MOTR | S | GYRO | RFID | X\r\n");

  for (;;) {
    const char *cmd = poll_command();
    if (cmd) {
      if (strcmp(cmd, "DEMO") == 0) {
        mission(true);
      } else if (strcmp(cmd, "GO") == 0) {
        mission(false);
      } else if (strcmp(cmd, "MOT") == 0) {
        motor_sanity_pulse();
      } else if (strcmp(cmd, "MOTR") == 0) {
        motor_reverse_sanity_pulse();
      } else if (strcmp(cmd, "S") == 0) {
        status_once();
      } else if (strcmp(cmd, "GYRO") == 0) {
        gyro_diagnostic();
      } else if (strcmp(cmd, "RFID") == 0) {
        rfid_diagnostic();
      } else if (strcmp(cmd, "X") == 0 || strcmp(cmd, "STOP") == 0) {
        motors_stop();
        print_both("STOP (nimic activ)\r\n");
      } else {
        print_both("Comanda necunoscuta: '%s'\r\n", cmd);
      }
      print_both(
          "Gata de comanda: DEMO | GO | MOT | MOTR | S | GYRO | RFID | X\r\n");
    }
    HAL_Delay(10);
  }
}
